In [1]:
import sqlite3
import pandas as pd

db = sqlite3.connect('School.sqlite')

In [2]:
data = pd.read_sql_query("Select * from Student", db)
data

   RollNumber     Name  Age
0         101     Aman   30
1         102     Amit   20
2         103    Mohit   50
3         104   Nikhil   30
4         105    Nidhi   30
5         106  Manisha   30
6         107   Ankush   30

In [3]:
data[data['Age'] == 30]

   RollNumber     Name  Age
0         101     Aman   30
3         104   Nikhil   30
4         105    Nidhi   30
5         106  Manisha   30
6         107   Ankush   30

In [4]:
data = pd.DataFrame([[201, "Aman", "English", 20000], [202, "Kiran", "Maths", 22000], [203, "Mahesh", "Science", 23000]], 
                   columns = ["ID", "Name", "Course", "Salary"])
data

    ID    Name   Course  Salary
0  201    Aman  English   20000
1  202   Kiran    Maths   22000
2  203  Mahesh  Science   23000

In [5]:
data.to_sql("Faculty", db) # a new table named faculty is created

In [6]:
data = pd.read_sql_query("Select * from Student", db)
data["Address"] = "Test"  # to add a column
data.to_sql("Student", db, if_exists = "replace")